Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །བམ་པོ་ཉི་ཤུ་པ། དེ་ནས་རྫས་བཤད་པར་བྱ་སྟེ། འཇིགས་པ་མེད་པས་སྤོས་ཀྱི་རིགས་ཙནྡན་དང་། ཏ་ག་ར་དང་། པུ་ཤེལ་ཅི་དང་། ལི་ཤི་དང་། ནཱ་ག་པུས་པ་དང་། སྤྲྀ་ཀ་དང་། རྒྱ་སྐྱེགས་དང་། ཁ་བར་ཎི་ཁ་དང་། སྤང་སྤོས་དང་། ན་ལ་ད་དང་།
en: Now I will specify the materials.

source: གུར་གུམ་དང་། གླ་རྩི་དང་། ག་བུར་དང་། སྒྲོན་ཤིང་དང་། གནྡ་པྲི་ཡང་ཀུ་དང་། ཀུན་དུ་རུ་དང་། ཤ་ཁ་ར་དང་། པདྨ་གེ་སར་དང་།
en: The skilled vidyā holder should procure fragrant substances such as sandalwood, tagara, vetiver, cloves, nāgapuṣpa, fenugreek, ukharvala grass, gandhamāṃsī, nalada, saffron, musk, camphor, meru, gandha, beautyberry, frankincense, sarkara, lotus filaments, olibanum oil, and beeswax.

source: དུ་རུ་སྐ་དང་། ཏིལ་མར་དང་། སྤྲ་ཚིལ་དང་། ལྷན་ཅིག་སྦྱར་བའི་ཕྱེ་མ་ཞིབ་མོ་ཤིན་ཏུ་འཇམ་པ།
en: He should grind everything into a fine, soft, smooth, and excellent powder.

source: ཤིན་ཏུ་མཉེན་པ། མཆོག་འདི་གཙང་མ་གཙང་སྦྲ་སྤྱོད་པས་ཐུབ་པ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དགེ་ཞིང་ཤིན་ཏུ་དུལ་བ། རབ་ཏུ་ཞི་བའི་རྣམ་པར་ཤིན་ཏུ་མཛེས་པར་བྱའོ།
en: Staying pure and following pure conduct, he should fashion a figure of the noble sage Avalokita that is beautiful and peaceful in appearance, executing the task to perfection.

source: །གསང་སྔགས་བརྒྱད་སྟོང་བཟླས་བརྗོད་བྱས་པས། ལན་ཅིག་བསྒྲུབས་པ་ནི་མཆོག་ཡིན་ཏེ།
en: He should incant the figure with the mantra one thousand and eight times, making his practice supreme.

source: འདི་ཡོངས་སུ་རྫོགས་ནས་ཁྲོ་བོའི་རྒྱལ་པོས་ཐམས་ཅད་ལ་མངོན་དུ་གཏོར་ཏེ་དེ་ནས་རིག་སྔགས་འཆང་གིས་ལས་བརྩམ་མོ།
en: To make everything complete, he should consecrate the figure with the mantra of Krodharāja. Only then can he commence the main rite. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གཙང་མར་གྱུར་པས་གོས་གཙང་མ་བགོས་ཏེ། ཤིན་ཏུ་ཁྲུས་བྱས་ལ་དྲིས་བྱུགས་པས་དཀྱིལ་འཁོར་གྲུ་བཞི་ཤིན་ཏུ་མཛེས་པ་གསལ་བ།
en: The skilled vidyā holder—ritually pure, bathed, wearing clean clothes, and perfumed with fragrances—should build a four-sided maṇḍala that is expertly laid out and has the surface area of a boat.

source: ཀོ་ལའི་ཚད་ཙམ་གྱི་དཀྱིལ་འཁོར་བཟང་པོ་ལེགས་པར་བྱུགས་པ་ཤིན་ཏུ་གསལ་བ་བྱའོ།
en: This divine maṇḍala should be smooth and smeared with various scents.

source: །དྲི་སྣ་ཚོགས་ཀྱིས་བྱུགས་པ་ཤིན་ཏུ་འཇམ་པ་ལ་ཙནྡན་དཀར་པོ་དང་།
en: Its surface should be soft, smooth, and colored with white sandalwood and saffron.

source: གུར་གུམ་གྱིས་དབུས་སུ་ལས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་ཕྱེ་བ་བྲི་བར་བྱའོ། །འདིར་ནི་པདྨའང་བྱས་ཏེ། །འདབ་མ་བརྒྱ་རྩ་བརྒྱད་པ་གེ་སར་དང་སྙིང་པོར་བཅས་པ།
en: In the center, the vidyā holder should demarcate the ritual circle with a lotus in it that has one hundred and eight petals, stamens, and a pericarp.

source: ཤིན་ཏུ་མཛེས་པ། ཤིན་ཏུ་བཟང་བ།
en: It should be well proportioned and beautiful.

source: ཙནྡན་དང་གུར་གུམ་གྱིས་བྲི་བར་བྱ་སྟེ། དེར་ཚོན་རྩི་གཞན་ནི་སྤྱད་པར་མི་བྱའོ།
en: The vidyā holder should paint it with white sandalwood and saffron but should not apply any other paints. “

source: །བུམ་པ་སྤོས་ཆུས་བཀང་བ་དང་། དེ་བཞིན་དུ་དྲི་ཆུ་དང་།
en: Because scented water should be part of a bali offering, he should arrange jars filled with scented water.

source: གཏོར་མ་ཐམས་ཅད་དྲི་སྣ་ཚོགས་ཀྱིས་བསྒོས་པ་དང་། ཅི་ཡོད་པའི་གཏོར་མ་གཞག་སྟེ།
en: All the bali articles that are available to him should be infused with various aromas.

source: དེ་ནས་འདིར་དཀྱིལ་འཁོར་བྱ་བ་ནི་གནས་སམ་དགོན་པའམ། ཁྱིམ་མམ་གང་དུ་གནས་པར་གྱུར་པ་དེར་ཁྲུ་གང་ཚད་དམ་ཁྲུ་དོའམ་ཁྲུ་གསུམ་མམ་ལྷག་པར་ཡང་བྱའོ། །དེ་བཞིན་དུ་བདུག་སྤོས་དང་། ཙནྡན་དང་།
en: The maṇḍala should be of the right size and located in either a dwelling place, a forest, a house, or wherever one’s home is.

source: ཨ་ག་རུ་དང་།
en: It should measure one, two, four, or more cubits.

source: དུ་རུ་སྐ་དང་།
en: The vidyā holder should set out incense of sandalwood, agarwood, frankincense, and olibanum.

source: ཀུན་ཏུ་རུའོ། །བ་དན་ཁ་དོག་སྣ་ཚོགས་པས་དཀྱིལ་འཁོར་ཀུན་ནས་བརྒྱན་པར་བྱའོ།
en: He should add color to the maṇḍala by placing banners in various colors around it.

source: །མེ་ཏོག་ཕྲེང་བ་དགྲམ་བྱ་ཞིང་། །དྲི་དང་བྱུག་པ་དེ་ཉིད་དང་། །ཀུན་དུ་མར་མེའི་ཕྲེང་བའོ།
en: He should strew the maṇḍala with flowers, decorate it with garlands, daub it with scented oils, and surround it with a row of lamps. “

source: །དེ་ནས་དྲི་ལས་བྱས་པའི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དཀྱིལ་འཁོར་གྱི་དབུས་སུ་པདྨའི་གེ་སར་གྱི་སྟེང་དུ་བཞག་པ་ལ།
en: He should then place the fragrant figure of Avalokiteśvara upon the filaments of the lotus in the center of the maṇḍala, sit down in a cross-legged position facing the figure, and commence the mantra recitation without saying anything else.

source: རིག་སྔགས་འཆང་མངོན་དུ་ཕྱོགས་པར་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འདུག་ནས་གཞན་མི་སྨྲ་བར་བཟླས་བརྗོད་བརྒྱད་སྟོང་བརྩམ་པར་བྱའོ།
en: He should silently recite the mantra one thousand and eight times.

source: །བརྒྱད་སྟོང་རྫོགས་པ་དང་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྐུ་ལས་འོད་ཟེར་སྣ་ཚོགས་འབྱུང་ཞིང་ཆེར་གཡོ་བར་འགྱུར།
en: When the number has been reached, the body of Noble Avalokiteśvara will radiate light of various colors and shake intensely.

source: རང་གི་ལག་པ་གཡས་པ་འབར་བར་འགྱུར་རོ།
en: The vidyā holder’s right arm will, likewise, blaze with light.

source: །གཟུགས་བརྙན་ལས་རིག་སྔགས་འཆང་ལེགས་སོ་ལེགས་སོ།
en: The following words will issue from the figure: ‘Good! It is good, vidyā holder!

source: །ཁྱོད་ཀྱིས་འདོད་པའི་ལས་ཐམས་ཅད་གྲུབ་བོ། །དོན་ཡོད་པ་ཆེན་པོའི་འཁོར་ལོ་རྣམ་པར་འཕྲུལ་པའི་དངོས་གྲུབ་དང་།
en: You have successfully performed the entire rite, thus accomplishing the magic of the amogha wheel.

source: ཐམས་ཅད་དུ་དགོས་པ་གྲུབ་པ་དེ་ཁོ་ན་ཉིད་གྲུབ་བོ།
en: You will fully accomplish all required tasks through your practice.

source: །ཁྱོད་ཀྱིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་འདི་མཆོག་ཏུ་གྲུབ་བོ།
en: You have accomplished, as well as can be, the heart essence of Amoghapāśa.

source: །ཁྱོད་ཀྱིས་སྒྲུབ་པའི་ཆོ་ག་རྒྱ་ཆེར་མཆོག་ཏུ་གྲུབ་བོ་ཞེས་སྒྲ་འབྱུང་ངོ་།
en: You have accomplished, in the best possible way, the elaborate practice procedure.’ “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་དགོས་པ་ཡོངས་སུ་རྫོགས་པའི་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་ཇི་ལྟར་དགོས་པར་བྱ་སྟེ། སློབ་མ་གཞུག་པ་དང་། དམ་ཚིག་ནི་འདིར་དགོས་པ་ཞེས་བྱའོ།
en: After that, the vidyā holder should complete the rite as the maṇḍala procedure requires, namely, ushering the disciples into the maṇḍala and performing the relevant samaya rite.

source: དེ་ནས་རིག་སྔགས་འཆང་གིས་གང་གི་ཚེ་དགོས་པ་བྱུང་བ་དེའི་ཚེ་དྲི་ལས་བྱས་པའི་མགོན་པོ་ལ་སྔར་མཆོད་པ་བྱ་སྟེ།
en: Thereafter, the vidyā holder should perform the same worship as before, whenever there is a task to perform.

source: དེ་ནས་དགོས་པ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: By employing the figure of the Lord made from fragrant substances, he will accomplish anything that needs to be accomplished.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་མདུན་དུ་བཞག་ལ།
en: Placing the figure of Noble Avalokiteśvara in front of himself, he should recite the mantra one hundred and eight times.

source: བཟླས་བརྗོད་བརྒྱད་བརྒྱ་བྱས་ན་དགོས་པ་སྣ་ཚོགས་རྨི་ལམ་དུ་སྟོན་ཅིང་ཇི་ལྟར་བསམས་པ་ཐམས་ཅད་སྟོན་པར་འགྱུར་རོ།
en: Noble Avalokiteśvara will then indicate to him, in his sleep, the various things that need to be done, explaining everything as necessary. “

source: །དེའི་མདུན་དུ་ཙནྡན་དཀར་པོ་ལས་དཀྱིལ་འཁོར་བྱས་ལ། ཙནྡན་དཀར་པོའི་སྦྱིན་སྲེག་བརྒྱ་རྩ་བརྒྱད་བྱའོ།
en: The vidyā holder should use white sandalwood to demarcate a maṇḍala in front of the figure of Noble Avalokiteśvara and offer him one hundred and eight homas of white sandalwood.

source: །དེ་ནས་ཐལ་བ་ལ་བཟླས་བརྗོད་ལན་བརྒྱ་རྩ་བརྒྱད་བྱ་སྟེ། རང་གི་ལུས་མཐའ་དག་ཁྱབ་པར་བསྐུ་ཞིང་།
en: Having then incanted the ashes with the mantra one hundred and eight times, he should rub them onto his entire body.

source: ཐལ་བ་དེ་ཉིད་དང་། ཡུངས་ཀར་གྱི་བྱུག་པ་ཕྱོགས་བཞིར་གཏོར་ན་འཇིག་རྟེན་དབང་ཕྱུག་གི་གཟུགས་ཇི་ལྟ་བ་དེ་ལྟར་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མངོན་སུམ་དུ་མཐོང་སྟེ།
en: If he then casts the ashes mixed with mustard seeds in the four directions, everyone will perceive him in the form of the Lokeśvara.

source: ཇི་སྲིད་དུ་ཕྱིར་བསྡུ་བ་མ་བྱས་པ་དེ་སྲིད་དུ་འཇིག་རྟེན་དབང་ཕྱུག་གི་གཟུགས་སུ་སྣང་བར་འགྱུར་རོ། །དྲི་ཆུ་དང་ཡུངས་ཀར་གྱིས་མངོན་དུ་ཕྱོགས་པར་གཏོར་ན་ཕྱིར་བསྡུ་བ་བྱས་པར་འགྱུར་རོ།
en: He will appear in the form of the Lokeśvara until he applies the counteragent by sprinkling himself with mustard seeds mixed with perfumed water. “

source: །ཐལ་བ་དེས་རབ་ཏུ་བདུགས་ཏེ་དུར་ཁྲོད་ཀྱི་ནང་དུ་ཞུགས་ན་འབྱུང་པོའི་དཔུང་དང་འཁོར་དང་བཅས་པ་མདུན་ན་ཉེ་བར་གནས་པར་འགྱུར་རོ།
en: If the vidyā holder enters a charnel ground while burning incense containing the same ashes, he will become the lord of the bhūtas, who will approach him with their army and retinue.

source: །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་།
en: All the yakṣas, rākṣasas, bhūtas, and piśācas will approach and attend upon him.

source: ཤ་ཟ་ཐམས་ཅད་མདུན་ན་ཉེ་བར་གནས་ཤིང་དབང་དུ་གྱུར་ནས་གནས་ཏེ།
en: They will remain in his thrall and become his servants, eager to carry out his orders.

source: བདག་དང་ནོར་གྱིས་བགྱི་བ་ཅི་མཆིས་ཞེས་བྱ་བ་བྱེད་དོ།
en: They will serve him both themselves and with their wealth. “

source: །རང་ལ་བྱུགས་ཏེ་ཚོགས་ཀྱི་ནང་ངམ། དགེ་འདུན་གྱི་ནང་དུ་ཞུགས་ན་སྟོན་པ་མཐོང་བ་ཇི་ལྟར་རིག་སྔགས་འཆང་སྣང་ཞིང་མཐོང་སྟེ།
en: If the vidyā holder smears himself with the ashes and enters a group of people or a congregation of monks, they will perceive him as the Teacher.

source: མཆོད་པའི་འོས་ཆེན་པོར་འགྱུར་རོ། །ཕྱག་བྱ་བའི་འོས་སུ་འགྱུར། དོན་དང་མཆོད་པ་ཆེན་པོ་འཐོབ་པར་འགྱུར་རོ།
en: He will become a recipient of great honors and worship; he will be praised and receive offerings of great value.

source: །ཐལ་བས་ལུས་བསྐུས་ཏེ་ཀླུའི་མཚོར་ཞུགས་ན་ཀླུའི་རྒྱལ་པོ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་གནས་ཏེ་བཀའ་བཞིན་བྱེད་པར་འགྱུར་ཞིང་ཇི་སྲིད་འཚོའི་བར་དུ་ཉེ་བར་གནས་པར་འགྱུར་རོ།
en: If he smears his body with the ashes and enters a nāga pond, sixty-eight thousand nāga kings will all fall under and remain in his thrall. They will carry out his orders and attend upon him for as long as he lives.

source: །རང་ལ་བྱུགས་ཏེ་རྒྱལ་པོའི་ཕོ་བྲང་དུ་ཞུགས་ན། རྒྱལ་པོ་བཙུན་མོ་དང་འཁོར་དུ་བཅས་པ་རྣམས་དབང་དུ་འགྱུར་ཏེ།
en: If he smears himself with the ashes and enters a royal household, the king with his harem and retinue will fall under and remain in his thrall.

source: ཅི་བགྱི་ཞེས་བྱ་བ་བྱེད་ཅིང་མདུན་ན་ཉེ་བར་གནས་པར་འགྱུར་རོ།
en: They will become his servants, eager to carry out his orders.

source: །འཇིག་རྟེན་གྱི་བླ་མ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་མཆོད་པ་ཆེན་པོ་འབྱུང་བར་འགྱུར། དོན་ཆེན་པོ་དང་མཆོད་པ་ཆེན་པོ་འཐོབ་པར་འགྱུར།
en: He will be worshiped and honored as a great teacher of the world, receive many offerings, and acquire great wealth.

source: ཇི་སྲིད་འཚོའི་བར་དུ་ཉེ་བར་གནས་པར་འགྱུར་ཏེ། སྟོན་པ་འདྲེན་པ་ཇི་ལྟ་བ་བཞིན་ནོ།
en: People will serve him for as long as he lives, as they would serve the Teacher, the Guide. “

source: །གང་དང་གང་ལ་ཐལ་བས་རེག་པ་ཙམ་གྱིས་དེ་དང་དེའི་ནད་ཐམས་ཅད་བྲལ་བར་འགྱུར་སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་དག་པར་འགྱུར་ངན་འགྲོའི་སྒོ་ཐམས་ཅད་གཅད་པར་འགྱུར།
en: Those who come in contact with the ashes will be cured of every disease as soon as they touch them. They will be purged of all their wrongdoings and obscurations, and the doors to unhappy rebirths will be closed for them.

source: མཆོག་ཏུ་བདེ་བ་དང་ལྡན་པར་འགྱུར་རོ། །ཤི་འཕོས་ནས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སྐྱེ་བར་འགྱུར་རོ། །བྱས་པ་མི་གཟོ་བ། གསང་སྔགས་ཀྱི་གདོལ་པ། མ་གུས་པ།
en: They will experience supreme happiness, and after they die, they will go to the world sphere of Sukhāvatī.

source: བླ་མར་མི་བྱེད་པ། རློམ་སེམས་ཅན། ང་རྒྱལ་དང་ལྡན་པ། བདུད་ཀྱི་ཕྱོགས་པ། སྐྱེས་བུ་གཏི་མུག་ཅན། བསོགས་པ་ལ་ཞེན་པ།
en: The exceptions are those who are ungrateful, mantra outcasts, those who are disobedient and disrespectful to their teacher, self-important people who show contempt for others, the allies of Māra, and deluded, stingy, and narcissistic people.

source: ཁེངས་པ། ང་རྒྱལ་ཅན་དེ་དག་གིས་གང་དུ་ཡང་དངོས་གྲུབ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: I do not see how they could possibly attain accomplishment.

source: །དེ་དག་ཡུན་རིང་པོར་ཐར་པ་མི་རྙེད་པས་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་།
en: They will not be liberated for a long time.

source: གང་ཡང་རིག་སྔགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་རྣམས་ཀྱིས་སྨད་པ།
en: They are reproached by the tathāgatas of the three times, by bodhisattvas, and by the vidyā deities of the maṇḍala.

source: སྐྱེ་བ་བརྒྱུད་པར་རང་གི་རྒྱུད་ལ་དངོས་གྲུབ་བསྲེགས་པ།
en: Their lineages will not continue.

source: འཇིག་རྟེན་འདི་དང་ཕ་རོལ་ཆུད་གསོན་པ་དག་ནི་མ་གཏོགས་ཏེ།
en: They will burn and will destroy their chances of accomplishment in this world and the next.

source: དེ་ལྟ་མོད་ཀྱི་འདིར་བདག་གིས་ཅུང་ཟད་ཀྱང་མ་ནོངས་ཏེ།
en: This is not my fault at all. “

source: སྡུག་བསྔལ་མང་པོ་དང་ཆེན་པོའི་སེམས་ཅན་དགྲོལ་བར་རྔོ་མི་ཐོགས་ལགས་སོ།
en: Such beings will suffer great pain before they can be liberated by the great compassion and concern felt by the Buddha.

source: །སངས་རྒྱས་ཐུགས་རྗེ་ཆེན་པོས་བཀའ་སྩལ་པའི་ཡིད་ལ་བགྱི་བ་བསྐལ་པ་བགྲངས་པར་ཡིད་ལ་བགྱིས་པས་དགྲོལ་བར་རྡོ་མི་ཐོགས་ལགས་སོ།
en: It will be possible for the Buddha to liberate them after keeping them in his heart for an infinite eon.

source: །དེ་ལྟ་མོད་ཀྱི་སྡུག་བསྔལ་མང་པོ་བརྒྱུད་པར་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ།
en: In the meantime, they will experience much suffering and pain, again and again.

source: །དངོས་གྲུབ་ནི་བྱམས་པས་འཐོབ་སྟེ། བྱམས་པ་དང་། གསང་སྔགས་ཀྱི་གོ་ཆ་བགོས་པ། བྱམས་པའི་རལ་གྲི་ཐོགས་པ།
en: One attains accomplishment through loving kindness, with love and mantra for armor.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་ཞིང་མཉེས་གཤིན་པ་ལ་དེ་ཁོ་ན་ཉིད་སྒྲུབ་པའི་དངོས་གྲུབ་འདི་དག་འཇིག་རྟེན་འདྲེན་པས་རྗེས་སུ་གནང་ངོ་།
en: The sword of loving kindness, taken up for the sake of all beings who are like one’s beloved children, is the true practice, and it is the essence of the accomplishment as approved by the guides of the world. “

source: །མགོན་པོ་འདི་མཐོང་བ་ཙམ་གྱིས་སྤོས་ཀྱི་གཟུགས་ཀྱི་འཇིག་རྟེན་མགོན་པོ་མཐོང་བ་དང་། འཇིག་རྟེན་འདྲེན་པ་རང་གི་གཟུགས་སུ་མངོན་སུམ་དུ་མཐོང་བ་མཚུངས་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པར་བགྱིའོ།
en: For those without a protector, to see the fragrant form of the Lord of the World is very special; simply to see it is the same as seeing the Lord of the World in person.

source: །སངས་རྒྱས་བྱེ་བ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་མངོན་སུམ་དུ་མཐོང་བ་ཁོ་ན་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་མཐོང་བ་མཚུངས་པ་ཁོ་ནར་ཁོང་དུ་ཆུད་པར་བགྱི་སྟེ། འདི་ལྟར་ཤེས་པར་བྱའོ། དེ་ནས་ཕྱིར་མི་ལྡོག་པའི་གནས་རིག་སྔགས་འཆང་གི་འཁོར་ལོས་སྒྱུར་བ་ཆེན་པོ་སྒྲུབ་པར་འདོད་པའི་དགེ་སློང་ངམ། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། རྒྱལ་པོའམ།
en: In truth, it is the same as seeing the faces of as many buddhas as there are grains of sand in ten million Gaṅgā rivers.

source: བློན་པོ་ཆེན་པོའམ། རིག་སྔགས་འཆང་ངམ། གཞན་གང་ཡང་རུང་བའི་རིག་སྔགས་འཆང་གིས་ཕྱིར་མི་ལྡོག་པའི་གནས་ཐོབ་པར་འདོད་པ་དང་།
en: It is emphasized that seeing the figure is the same as seeing the Lord himself. “

source: དུས་གསུམ་དུ་གཤེགས་པའི་སངས་རྒྱས་མཐོང་བར་འདོད་པ་དང་། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གནས་མཐོང་བར་འདོད་པ་དང་། རིག་སྔགས་འཆང་གི་དཀྱིལ་འཁོར་གྱི་ལྷ་ཐམས་ཅད་མཐོང་བར་འདོད་པ་དང་། འཕགས་པ་རྡོ་རྗེ་འཛིན་མཐོང་བར་འདོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་རིགས་ཐམས་ཅད་ཀྱི་སྤྱིའི་དམ་ཚིག་མཐོང་བར་འདོད་ན་ཆོ་ག་འདི་བསྒྲུབ་པར་བྱ་སྟེ།
en: Whether the vidyā holder is a monk, a son or daughter of good family, a king, a queen dowager, or any other type of practitioner, if they want to attain the level of not turning back and become a vidyādhara emperor, if they want to see the buddhas of the three times, if they want to see the abode of Noble Avalokiteśvara, if they want to see all the deities of the vidyā maṇḍala, if they want to see Noble Vajradhara, if they want to see the samaya that binds with all tathāgata families equally, they should perform the following practice procedure.

source: སྙིང་པོ་དང་བཅས། བྱ་བ་དང་བཅས་པ་དེས་མྱུར་བ་དང་། ཤིན་ཏུ་མྱུར་བ་དང་། མགྱོགས་པར་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མངོན་སུམ་དུ་ཆོ་འཕྲུལ་རྨད་དུ་བྱུང་བ་གསང་བ་སྟོན་པར་མཐོང་སྟེ།
en: If they are kindhearted and diligent, they will soon be able to work magic and easily produce secret wondrous miracles that will be plainly seen by the entire world.

source: འདི་ལ་སོམ་ཉི་དང་ནེ་མནུར་བསྐྱེད་པར་མི་བྱའོ།
en: This should not be doubted or disbelieved.

source: །ཐེ་ཙོམ་དང་ཡིད་གཉིས་བསྐྱེད་པར་མི་བྱའོ།
en: One should not be skeptical or harbor uncertainty. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གསེར་གྱི་མདོག་ཅན་སོར་བཞིའི་ཚད་ཙམ། ཚངས་པའི་ཆ་བྱད་འཆང་བ། རལ་པའི་ཐོར་ཚུགས་ཀྱིས་བརྒྱན་པ་བྱ་སྟེ།
en: The vidyā holder should fashion a golden figure of Noble Avalokiteśvara four fingers tall, wearing the garb of Brahmā, and adorned with a diadem upon its topknot.

source: ཤིན་ཏུ་ཚད་དང་ལྡན་པ། ཆ་བྱད་མཛེས་པ། ཆ་ཤིན་ཏུ་རྣམ་པར་མཛེས་པ། ཕྱག་གཉིས་པ། སྤྱན་གསུམ་པ།
en: It should be of exactly the right size, dressed in fine garments, and well proportioned, and it should have two arms and three eyes.

source: འོད་དཔག་མེད་པའི་དབུ་རྒྱན་ཅན། གཡས་ན་ཟླ་བ་ཚེས་པ།
en: It should be crowned with Amitābha and a crescent moon to Amitābha’s right.

source: ཕྱག་གཡོན་ན་པདྨ་དང་། རིལ་བ་སྤྱི་བླུགས་བསྣམས་པ། ཕྱག་གཡས་མི་འཇིགས་པ་སྦྱིན་པ།
en: It should hold a lotus and a water pot in its left hand and display the mudrā of granting fearlessness with its right.

source: སྐུའི་ནང་ག་བུར་དང་། གླ་རྩི་དང་རིང་བསྲེལ་གྱིས་བཀང་བ།
en: The figure should contain camphor, musk, and relics within its body.

source: གཡས་ན་ལྷ་མོ་སྒྲོལ་མ་དངུལ་ལས་བྱས་པ་ཐལ་མོ་སྦྱར་ཏེ་ཡིད་ཙམ་འདུད་པ། གསེར་གྱི་རྒྱན་གྱིས་བརྒྱན་པ་དང་། གཡོན་ན་དངུལ་ལས་དཀར་མོ་ཐལ་མོ་སྦྱར་ཏེ་ཡིད་ཙམ་འདུད་པ་པདྨའི་གདན་ལ་བཞུགས་པར་བྱའོ།
en: The goddess Tārā, to the right of Noble Avalokiteśvara, should be fashioned from silver, bowing with folded hands and adorned with golden ornaments. Śvetā should be to the left of Noble Avalokiteśvara, bowing with folded hands. “Noble Avalokiteśvara sits on a lotus seat among miraculous displays.

source: །སྟེང་གི་གཡས་ཕྱོགས་ན་འོད་དཔག་མེད་སྐྱིལ་མོ་ཀྲུང་བཅས་བཅས་ཏེ་བཞུགས་པ་དང་།
en: Above and to the right is Amitābha, sitting in a cross-legged posture.

source: གཡོན་ན་ཤཱཀྱའི་རྒྱལ་པོ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་པ་དགོད་པར་བྱའོ།
en: Above and to the left is the king of the Śākyas, sitting in a cross-legged posture.

source: །འོད་འདོམ་གང་དང་བཅས་པས་ལེགས་པར་བརྒྱན་པར་བྱ་ཞིང་། གནད་དང་གནད་ཤིན་ཏུ་རྣམ་པར་འབྱེས་པ། སྐྲ་དང་། དཔྲལ་བ་དང་། སྨིན་མ་དང་། ཤངས་དང་། སྙན་དང་། ཞལ་དང་། མགུལ་པ་དང་། དཔུང་པ་དང་། ནུ་མ་དང་། རྐེད་པ་དང་།
en: Noble Avalokiteśvara is surrounded by a halo of light extending for one fathom.

source: བརླ་དང་། པུས་མོ་དང་། བྱིན་པ་དང་། ཞབས་དང་། ཕྱག་གི་སོར་མོ་མཉམ་ཞིང་ཐམས་ཅད་དུ་མཛེས་པ།
en: All his body parts—his hair, forehead, eyebrows, nose, ears, mouth, neck, arms, chest, hips, thighs, knees, calves, feet, hands, and fingers—should be made to size, be symmetrical, and have the appropriate figure.

source: སྐུ་ཆུ་ཞེང་གབ་ཅིང་མཐོ་དམན་རན་པ། མཆོད་ཕྱིར་ཐོགས་པ་དཀར་པོ་འཆང་བ་བྱའོ།
en: The image should also be wearing a white sacred thread.

source: །ལས་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་ཤིང་ཤིན་ཏུ་མཐར་ཕྱིན་པ་དང་།
en: The sculpting work should be executed to perfection. “

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་ཟིན་པར་རིག་ནས།
en: The vidyā holder, satisfied that the form of Noble Avalokiteśvara is now complete and perfect, should commence the construction of the maṇḍala.

source: དེ་ནས་རིག་སྔགས་འཆང་གིས་རྒྱུ་སྐར་བཟང་པོའི་ཟླ་བ་ཉའམ། ཚེས་བརྒྱད་དམ། བཅྭ་ལྔའམ། བཅུ་གསུམ་མམ། བཅུ་བཞིའམ།
en: He should start on the full moon day during an auspicious nakṣatra or, alternatively, on the eighth, fifteenth, thirteenth, or fourteenth lunar day.

source: རྒྱུ་སྐར་བཀྲ་ཤིས་པ་རྒྱལ་གྱི་ཉི་མ་དང་མཐུན་པ་རྙེད་ནས་དཀྱིལ་འཁོར་བསྒྲུབ་པར་བྱ་སྟེ།
en: A suitable time to construct the maṇḍala would be an auspicious day during the nakṣatra of Puṣya.

source: དཀྱིལ་འཁོར་ཤིན་ཏུ་མཛེས་པར་བྱ་བ་ནི་གྲུ་བཞི་ལ་ཆ་ལེགས་པར་ཕྱེ་བ།
en: It should be a fine, symmetrical maṇḍala with four sides, the corresponding four sections, and the surface area of a boat.

source: ཀོ་ལའི་ཚད་ཙམ་ལ་ཐེམ་སྐས་བཞིས་བརྒྱན་པ། ཁྲུ་གསུམ་པར་རྣམ་པར་དབྱེ་བར་བྱ་སྟེ། ཆུང་བ་དང་ལྷག་པར་ནི་མི་བྱའོ།
en: It should be adorned with four stairways and be no more and no less than three cubits wide.

source: །ལེགས་པར་བྱུགས་པ་ཤིན་ཏུ་འཇམ་པ། སྙི་བ། མཉེན་པ།
en: The surface should be wiped clean, smooth, pliant, and soft.

source: དབྱིབས་ལེགས་པ་ལ་ཚོན་རྩི་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་དབྱེ་ཞིང་དཀྱིལ་འཁོར་དམ་པ་ཐིག་གདབ་པ་ནི་ཤིན་ཏུ་རྣམ་པར་མཛེས་པ།
en: The maṇḍala’s sections should be delimited with a multicolored thread. Such a maṇḍala is supreme. “

source: སྒོ་བཞི་པ་ལ་དཀྱིལ་འཁོར་གྱི་དབུས་ཀྱི་སྙིང་པོར་པདྨའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་དོན་ཡོད་པའི་ཞགས་པའི་དཀྱིལ་འཁོར་བྲིའོ།
en: The maṇḍala should have four doors that are laid out symmetrically. Within the inner zone of the maṇḍala, the vidyā holder should paint the maṇḍala of the lotus family, the maṇḍala of Amoghapāśa.

source: །ཕྱི་རོལ་གྱི་དཀྱིལ་འཁོར་གྱི་གནས་སུ་ཆ་རྣམ་པ་བརྒྱད་དུ་ཕྱེ་ལ།
en: The outer zone of the maṇḍala should be divided into eight sections.

source: ལྷོའི་གྲྭའི་གནས་སུ་དེ་བཞིན་གཤེགས་པའི་རིགས་ཚོན་སྣ་ཚོགས་ཀྱིས་བྲིའོ།
en: In the southern section, he should use various colors to paint the maṇḍala of the tathāgata family.

source: །དེ་ནས་བྱང་གི་གྲྭར་བྲི་བ་ནི་རྡོ་རྗེའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་ཚོན་རྩི་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བཀྲ་བར་བྲིའོ།
en: In the northern section, he should draw the maṇḍala of the vajra family and paint it in various colors.

source: །དེ་ནས་ནུབ་ཀྱི་གྲྭར་བྲི་བ་ནི་ནོར་བུའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བཀྲ་བར་བྲིའོ།
en: In the western section, he should draw the maṇḍala of the jewel family and paint it in various vivid colors.

source: །དེ་ནས་ཤར་གྱི་གྲྭར་གླང་པོ་ཆེའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་ཚོན་རྩི་སྣ་ཚོགས་ཀྱིས་རྟག་ཏུ་ཤིན་ཏུ་མཛེས་པ་དང་།
en: In the eastern section, the skilled vidyā holder should always demarcate the maṇḍala of the elephant family using various colors. “

source: ཤིན་ཏུ་གསལ་བར་བྲིའོ། །ཤར་ཕྱོགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྒོར་རི་བོ་པོ་ཊ་ལ་མེ་ཏོག་དང་ཤིང་ལྗོན་པ་སྣ་ཚོགས་ཀྱིས་ལེགས་པར་བརྒྱན་པ་རིའི་ལྷ་དང་བཅས་པ་བྲིའོ།
en: At the eastern door he should draw Potala Mountain adorned with various trees and flowers and populated by mountain deities.

source: །ལྷོ་ཕྱོགས་ཀྱི་སྒོར་རི་རབ་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོས་ཀུན་ནས་དཀྲིས་པ་དང་། སུམ་ཅུ་རྩ་གསུམ་པའི་རིས་ཀྱི་ལྷ་བྲིའོ།
en: At the southern door he should draw Mount Meru populated by the gods from the realm of Thirty-Three and with the nāgas Nanda and Upananda coiled around it.

source: །བྱང་ཕྱོགས་ཀྱི་སྒོར་ནི་སྤོས་ཀྱི་ངད་ལྡང་དྲི་ཟའི་ཚོགས་ཀྱིས་གང་བ་ཤིང་ལྗོན་པ་སྣ་ཚོགས་ཀྱིས་ཤིན་ཏུ་མཛེས་པ་བྲིའོ།
en: At the northern door he should draw Gandhamādana Mountain graced with various trees and with groups of gandharvas roaming about.

source: །ནུབ་ཕྱོགས་ཀྱི་སྒོར་རི་ཏི་སེ་ལྷ་རྣམས་ཀྱི་གནས་མེ་ཏོག་སྣ་ཚོགས་དང་། འཁྲི་ཤིང་དང་། ཤིང་ལྗོན་པ་སྣ་ཚོགས་མཆོག་གིས་རྟག་ཏུ་གང་བ་བྲིའོ།
en: At the western door he should draw Mount Kailash populated with the deities who dwell there and graced with various flowers, vines, and, as always, fine specimens of trees.

source: །ལེགས་པར་ཟིན་ནས་ཀུན་ཏུ་ནི་མདུང་རྩེ་གསུམ་པའི་བར་ཕྲེང་ངོ་།
en: To give it a perfect finish, the maṇḍala should be surrounded by a blazing row of tridents. “

source: །དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་དེ་བཞིན་གཤེགས་པ་དང་། རྡོ་རྗེའི་རིགས་ཉིད་གཞག་གོ། །ནོར་བུའི་རིགས་སུ་དེ་བཞིན་གཤེགས་པ་གཞག་ཅིང་དེ་བཞིན་གཤེགས་པའི་རིགས་དང་།
en: The tathāgata family should include a tathāgata, the vajra family should include a tathāgata, and the jewel family should include a tathāgata.

source: ཐམས་ཅད་དུ་རྡོ་རྗེ་འཛིན་པ་བཞག་ན་སྤྱིའི་རིགས་འགྲུབ་བོ།
en: These tathāgata families should each include Vajradhara, demonstrating the universal sameness of the families.

source: །ལྷ་མོ་སྒྲོལ་མ་ནི་རི་བོ་པོ་ཊ་ལ་ལ་གཞག་གོ། །རི་རབ་ལ་ནི་གོས་དཀར་མོའོ། །དཔེ་མེད་མ་ནི་ཏི་སེའི་རྩེ་མོར་རོ། །སྒྲོལ་མ་བདུན་ནི་སྤོས་ཀྱི་ངད་ལྡང་ལ་གཞག་གོ །
en: The goddess Tārā should be located on Potala Mountain, Pāṇḍaravāsinī on Mount Sumeru, Anaupamyā on the top of Mount Kailash, and the seven Tārās on Gandhamādana Mountain.
